; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image2 - mode
	thermograph0 - mode
	image1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star4 - direction
	GroundStation7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Planet8 image2)
	(have_image Star9 image2)
	(have_image Phenomenon10 image1)
	(have_image Planet11 image2)
	(have_image Planet12 image1)
	(have_image Star13 thermograph0)
	(have_image Planet14 image2)
))

)

; plan
1. (turn_to satellite0 groundstation7 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 planet12 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet12)
   goals met: 0 of 8
5. (take_image satellite0 planet12 instrument0 image1)
   added: (have_image planet12 image1)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon10 instrument0 image1)
   added: (have_image phenomenon10 image1)
   goals met: 2 of 8
8. (turn_to satellite0 groundstation7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation7)
   goals met: 2 of 8
9. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 8
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 8
11. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 2 of 8
12. (turn_to satellite0 planet11 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet11)
   goals met: 2 of 8
13. (take_image satellite0 planet11 instrument1 image2)
   added: (have_image planet11 image2)
   goals met: 3 of 8
14. (turn_to satellite0 planet14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet14)
   goals met: 3 of 8
15. (take_image satellite0 planet14 instrument1 image2)
   added: (have_image planet14 image2)
   goals met: 4 of 8
16. (turn_to satellite0 planet8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet8)
   goals met: 4 of 8
17. (take_image satellite0 planet8 instrument1 image2)
   added: (have_image planet8 image2)
   goals met: 5 of 8
18. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 5 of 8
19. (take_image satellite0 star13 instrument1 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 6 of 8
20. (turn_to satellite0 star9 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star9)
   goals met: 6 of 8
21. (take_image satellite0 star9 instrument1 image2)
   added: (have_image star9 image2)
   goals met: 7 of 8
22. (turn_to satellite0 star3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star3)
   goals met: 8 of 8
